[
    {
      "id": 1,
      "image": "https://i.ibb.co/3yfzfgz/Reunion-2020.jpg",
      "title": "DataSoft Reunion 2020 ",
      "details": " Thank you for making DataSoft Reunion 2020 a huge success! Over 350 DataSoftians assembled on Saturday, 15 February at Neocampers to celebrate their journey with DataSoft. It was a wonderful opportunity to reconnect with former colleagues and reminisce about how DataSoft grew into the powerhouse it is today. Participants enjoyed touring Neocampers "
    },
    {
      "id": 2,
      "image": "https://i.ibb.co/fknk7t3/DISA-Sign.jpg",
      "title": "First Client Of Smart Enterprise For The New Year ",
      "details": " We are proud to inform you that DataSoft has signed with Integrated Development Foundation (IDF) to integrate Smart Enterprise ERP Solutions for their organization. The organization is thrilled with our World class ERP and has picked the Human Resource Information System (HRIS), Payroll Management and Fixed Asset Management modules. Mr. Zahirul Alam, Executive Director, Integrated"
    },
    {
      "id": 3,
      "image": "https://i.ibb.co/RBPd1LF/basa-smart.jpg",
      "title": "Partners’ Meet, 2019 And Launching Of MicroFin360 Next ",
      "details": "On 19th November at a convention hall of the capital, an event held by DataSoft for launching its flagship portfolio MicroFin360 as a new chapter “MicroFin360 NEXT” in the presence of all leading MFIs, MicroFin360 Partners and the Board of Directors of the company. Mr. Mahboob Zaman-Managing Director, Mr. Hasan Imam- Director Finance, Mr. Azad "
    },
    {
      "id": 4,
      "image": "https://i.ibb.co/5srwkZz/Mnashvi-Data-Soft.jpg",
      "title": "Sajida Foundation Signed A Contract With DataSoft ",
      "details": "Sajida Foundation and DataSoft , signed a contract to work jointly in the Microcredit Branch Automation process. MicroFin360 is a cloud-ready, dash-board driven Micro-Finance Management software specially developed for the Microfinance Institutes to automate their work-flow. The solution comes with an immense capability of synchronizing real-time data, management level monitoring, and centralized financial report consolidation. By "
    },
    {
      "id": 5,
      "image": "https://i.ibb.co/1vgGSBn/NAVIS-Data-Soft.jpg",
      "title": "DataSoft India Strategy Strengthened: Microfin360 Goes To North India",
      "details": "A signing ceremony between DataSoft and Manashvi Financiers of India took place on Aug 25, 2019 at DataSoft corporate head office. Under this agreement, Manashvi Financier will use our cloud based Microfin360 (www.microfin360.com) as a core banking solution to run their business operation in Northern India. CEO of Manashvi Financer, Sri. Deependra Singh Shekhawat and […]"
    },
    {
      "id": 6,
      "image": "https://i.ibb.co/RBPd1LF/basa-smart.jpg",
      "title": "Extending Partnership With World’s Leading Port & Logistics Software Company To Rejuvenate CPA",
      "details": "We are proud to announce that NAVIS and DataSoft has signed a contract on 15th July 2019 with Chittagong Port Authority (CPA) for up-gradation of Terminal Operating Systems (TOS) popularly known as Container Terminal Management System (CTMS). Mr. Mark T Welles General Manager and Vice President of NAVIS-Asia, Rear Admiral Zulfiqur Aziz (E), psc Chairman"
    },
    {
      "id": 7,
      "image": "https://i.ibb.co/87VYWH7/partnersmeet.jpg",
      "title": "Smart Enterprise ERP That Is Exceeding Local Market’s Expectations! ",
      "details": "We are proud to inform you that DataSoft has signed with Pathak Shamabesh Ltd. to integrate Smart Enterprise ERP Solutions for their organization. The organization is thrilled with our World class ERP and has picked the Human Resource Information System (HRIS), Payroll Management, Fixed Asset Management, Supply Chain Management, Sales Management, Customer Relationship Management and […]"
    },
    {
      "id": 8,
      "image": "https://i.ibb.co/tBDcmxb/PATHAK-SHAMABESH.jpg",
      "title": "Small Farmers Development Foundation (SFDF) Signed Contract With DataSoft",
      "details": "A momentous event to commemorate our continued partnership with Small Farmers Development Foundation (SFDF) – to enhance SFDF’s Microcredit Branch Automation process via our state-of-the-art MicroFin360 Services® platform, a web-based, dash-board driven Micro-Finance Management Solution. DataSoft is the premier solutions provider for microfinance institutions (MFIs) in Bangladesh and beyond. We look forward to continuing our […]"
    }
  ]